{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "1273c546",
   "metadata": {},
   "source": [
    "# Доработка"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "27b5d92f",
   "metadata": {},
   "source": [
    "### В первой задаче вы обрабатываете конкретный случай, когда в данных представлено только 3 пользователя (ключа). Ваш алгоритм не универсальный и не будет давать верный результат, если количество пользователей изменится. Просьба доработать реализацию в этом ключе, тут без цикла не обойтись;"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "836f6e99",
   "metadata": {},
   "source": [
    "## Задание 1\n",
    "Дана переменная, в которой хранится словарь, содержащий гео-метки для каждого пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран множество уникальных гео-меток всех пользователей.\n",
    "\n",
    "Пример работы программы:  \n",
    "\n",
    "```\n",
    "ids = {'user1': [213, 213, 213, 15, 213], \n",
    "       'user2': [54, 54, 119, 119, 119], \n",
    "       'user3': [213, 98, 98, 35]}\n",
    "```\n",
    "\n",
    "Результат: \n",
    "`{98, 35, 15, 213, 54, 119}`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "7f3c6170",
   "metadata": {},
   "outputs": [],
   "source": [
    "ids = {'user1': [213, 213, 213, 15, 213], \n",
    "       'user2': [54, 54, 119, 119, 119], \n",
    "       'user3': [213, 98, 98, 35]}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "0894ad40",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Результат: {98, 35, 15, 213, 54, 119}\n"
     ]
    }
   ],
   "source": [
    "geotags =[]\n",
    "for user in ids.keys():\n",
    "    for geo in ids[user]:\n",
    "        geotags.append(geo)\n",
    "print(\"Результат:\", set(geotags))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "af872c8b",
   "metadata": {},
   "source": [
    "### и во второй задаче ваша реализация жестко привязана к исходным данным. Ваша задача написать универсальный алгоритм, который будет корректно работать на любых данных аналогичной структуры. А что если запросы будут состоять из любого количества слов от 1 до 1000? Вы же не будете вручную прописывать каждый случай (как сейчас). Я бы рекомендовал использовать в качестве результирующей переменной словарь. Ключами бы в нем были варианты количества слов в запросах, а значениями – количество таких запросов. Формировали бы его так же в цикле, проверяли бы наличие текущей длины в ключах и наращивали бы значение на 1.\n",
    "\n",
    "#### Просьба доработать эти моменты, в остальном все хорошо."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7b6d7665",
   "metadata": {},
   "source": [
    "## Задание 2\n",
    "Дана переменная, в которой хранится список поисковых запросов пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран распределение количества слов в запросах в требуемом виде.\n",
    "\n",
    "Пример работы программы:  \n",
    "\n",
    "```\n",
    "queries = [\n",
    "    'смотреть сериалы онлайн',\n",
    "    'новости спорта',\n",
    "    'афиша кино',\n",
    "    'курс доллара',\n",
    "    'сериалы этим летом',\n",
    "    'курс по питону',\n",
    "    'сериалы про спорт',\n",
    "]\n",
    "```\n",
    "\n",
    "Результат: \n",
    "```\n",
    "Поисковых запросов, содержащих 2 слов(а): 42.86%\n",
    "Поисковых запросов, содержащих 3 слов(а): 57.14%\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "30a41d34",
   "metadata": {},
   "outputs": [],
   "source": [
    "queries = [\n",
    "    'смотреть сериалы онлайн',\n",
    "    'новости спорта',\n",
    "    'афиша кино',\n",
    "    'курс доллара',\n",
    "    'сериалы этим летом',\n",
    "    'курс по питону',\n",
    "    'сериалы про спорт'\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "25333552",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Поисковых запросов, содержащих 2 слов(а):, 42.86,%\n",
      "Поисковых запросов, содержащих 3 слов(а):, 57.14,%\n"
     ]
    }
   ],
   "source": [
    "d={}\n",
    "dic={}\n",
    "for i, k in enumerate(queries):\n",
    "    d[str(i+1)]=len(k.split(' '))\n",
    "for l in range((max(d.values()))+1):\n",
    "    dic[l]=0\n",
    "for n in dic.keys():\n",
    "    p=0\n",
    "    for m in queries:\n",
    "        if len(m.split(' '))==int(n):\n",
    "            p+=1\n",
    "        dic[n]=p\n",
    "    if dic[n]!=0:\n",
    "        print(f\"Поисковых запросов, содержащих {str(n)} слов(а):, {round(dic[n]/(len(queries))*100,2)},%\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
